IdeaRS.Connections
MemberLongitudinalStiffenerData Class
Compatible with IDEA StatiCa 0.0
 Data for longitudinal (horizontal) stiffener on steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.GeneralPlateData
 IdeaRS.Connections.Data.MemberLongitudinalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberLongitudinalStiffenerData : GeneralPlateData
The MemberLongitudinalStiffenerData type exposes the following members.
Constructors
Name | Description
MemberLongitudinalStiffenerData
Initializes a new instance of the MemberLongitudinalStiffenerData class
Top
Properties
Name | Description
BeginOffsetX
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
 (Inherited from GeneralPlateData.)
CustomGeometry
 Gets or sets the custom geometrical data
 (Inherited from GeneralPlateData.)
EndOffsetX
IsActive |  (Inherited from ConnectionCmdData.)
LocIsWelded |  (Inherited from GeneralPlateData.)
LocJointPoint |  (Inherited from GeneralPlateData.)
LocJointRotation |  (Inherited from GeneralPlateData.)
LocLocation |  (Inherited from GeneralPlateData.)
LocMemberPath |  (Inherited from GeneralPlateData.)
LocPitch |  (Inherited from GeneralPlateData.)
LocPlatePath |  (Inherited from GeneralPlateData.)
LocRelatedTo |  (Inherited from GeneralPlateData.)
LocRotation |  (Inherited from GeneralPlateData.)
LocType |  (Inherited from GeneralPlateData.)
LocXposition |  (Inherited from GeneralPlateData.)
LocYposition |  (Inherited from GeneralPlateData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetY
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
 (Inherited from GeneralPlateData.)
PlateEdgeInx |  (Inherited from GeneralPlateData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
Shape |  (Inherited from GeneralPlateData.)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShapeParam1
 Rectangle-B1, Circle-R
 (Inherited from GeneralPlateData.)
ShapeParam2
 Rectangle-B2
 (Inherited from GeneralPlateData.)
ShapeParam3
 Rectangle-H1
 (Inherited from GeneralPlateData.)
ShapeParam4
 Rectangle-H2
 (Inherited from GeneralPlateData.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the connected member to plate weld
 (Inherited from GeneralPlateData.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace